zegonix/mc1_rohneced_schoejo2/lab13/code/unittest/reg_stm32f4xx.h
/* ----------------------------------------------------------------------------
 * --  _____       ______  _____                                              -
 * -- |_   _|     |  ____|/ ____|                                             -
 * --   | |  _ __ | |__  | (___    Institute of Embedded Systems              -
 * --   | | | '_ \|  __|  \___ \   Zurich University of                       -
 * --  _| |_| | | | |____ ____) |  Applied Sciences                           -
 * -- |_____|_| |_|______|_____/   8401 Winterthur, Switzerland               -
 * ------------------------------------------------------------------------- */
/**
 *  \brief  Registries for STM32F4xx.
 *
 *  \file   reg_stm32f4xx.h
 *  $Id: reg_stm32f4xx.h 2345 2015-07-29 08:35:08Z feur $
 * ------------------------------------------------------------------------- */
#ifndef _REG_STM32F4xx_H
#define _REG_STM32F4xx_H

#include <stdint.h>

///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
#include "arm_peripherals.h"

#define APB1_OFFSET      0x00000
#define APB2_OFFSET      0x10000
#define AHB1_OFFSET      0x20000
#define AHB2_OFFSET      0x00000
#define INTERNAL_OFFSET  0x00000
//#define FMC_OFFSET       0x00000

#define APB1_BASE        apb1     // address of starting position
#define APB2_BASE        apb2     // address of starting position
#define AHB1_BASE        ahb1     // address of starting position
#define AHB2_BASE        ahb2     // address of starting position
#define INTERNAL_BASE    intperiph    // address of starting position
#define FMC_BASE         fmc    // address of starting position

#define APB1_SECTION     (APB1_BASE - APB1_OFFSET)
#define APB2_SECTION     (APB2_BASE - APB2_OFFSET)
#define AHB1_SECTION     (AHB1_BASE - AHB1_OFFSET)
#define AHB2_SECTION     (AHB2_BASE - AHB2_OFFSET)
#define INTERNAL_SECTION (INTERNAL_BASE - INTERNAL_OFFSET)
//#define FMC_SECTION      (FMC_BASE - FMC_OFFSET)

/* Set and clear bit in register. */
#define REG_SET(REG, BIT)       ( (REG) |= (BIT) )
#define REG_CLR(REG, BIT)       ( (REG) &= ~(BIT) )

/*  FLASH - flash interface register
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_flash_t
 *  \brief  Representation of FLASH register.
 *
 *  Described in reference manual p.73ff.
 */
typedef struct {
    volatile uint32_t ACR;      /**< . */
    volatile uint32_t KEYR;     /**< . */
    volatile uint32_t OPTKEYR;  /**< . */
    volatile uint32_t SR;       /**< . */
    volatile uint32_t CR;       /**< . */
    volatile uint32_t OPTCR[2]; /**< . */
} reg_flash_t;


#define FLASH ((reg_flash_t *)(AHB1_SECTION + 0x23c00)


/*  PWR - power controller
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_pwr_t
 *  \brief  Representation of PWR register.
 *
 *  Described in reference manual p.115ff.
 */
typedef struct {
    volatile uint32_t CR;       /**< . */
    volatile uint32_t CSR;      /**< . */
} reg_pwr_t;


#define PWR ((reg_pwr_t *)(APB1_SECTION + 0x7000))


/*  RCC - register clock control
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_rcc_t
 *  \brief  Representation of RCC register.
 *
 *  Described in reference manual p.147ff.
 */
typedef struct {
    volatile uint32_t CR;           /**< Clock control register. */
    volatile uint32_t PLLCFGR;      /**< PLL configuration register. */
    volatile uint32_t CFGR;         /**< Clock configuration register. */
    volatile uint32_t CIR;          /**< Clock interrupt register. */
    volatile uint32_t AHBRSTR[3];   /**< AHB reset register. */
    uint32_t RESERVED;
    volatile uint32_t APBRSTR[2];   /**< APB reset register. */
    uint32_t RESERVED1[2];
    volatile uint32_t AHBENR[3];    /**< AHB clock enable register. */
    uint32_t RESERVED2;
    volatile uint32_t APBENR[2];    /**< APB clock enable register. */
    uint32_t RESERVED3[2];
    volatile uint32_t AHBLPENR[3];  /**< AHB clock enable in lp register. */
    uint32_t RESERVED4;
    volatile uint32_t APBLPENR[2];  /**< APB clock enable in lp register. */
    uint32_t RESERVED5[2];
    volatile uint32_t BDCR;         /**< Backup domain control register. */
    volatile uint32_t CSR;          /**< Clock controll and status register. */
    uint32_t RESERVED6[2];
    volatile uint32_t SSCGR;        /**< Spreadspectrum clock gen. register. */
    volatile uint32_t PLLI2SCFGR;   /**< PLLI2S configuration register. */
    volatile uint32_t PLLSAICFGR;   /**< PLLSAI configuration register. */
    volatile uint32_t DCKCFGR;      /**< Dedicated clock conf. register. */
} reg_rcc_t;


#define RCC ((reg_rcc_t *)(AHB1_SECTION + 0x23800))


/*  GPIO - general purpose input / output
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_gpio_t
 *  \brief  Representation of GPIO register.
 *
 *  Described in reference manual p.265ff.
 */
typedef struct {
    volatile uint32_t MODER;    /**< Port mode register. */
    volatile uint32_t OTYPER;   /**< Output type register. */
    volatile uint32_t OSPEEDR;  /**< Output speed register. */
    volatile uint32_t PUPDR;    /**< Port pull-up/pull-down register. */
    volatile uint32_t IDR;      /**< Input data register. */
    volatile uint32_t ODR;      /**< output data register. */
    volatile uint16_t BSRR[2];  /**< [0]: Bit set register,
                                     [1]: Bit reset register. */
    volatile uint32_t LCKR;     /**< Port lock register. */
    volatile uint32_t AFR[2];   /**< [0]: AF register pin 0..7,
                                     [1]: AF register pin 8..15. */
} reg_gpio_t;


#define GPIOA ((reg_gpio_t *)(AHB1_SECTION + 0x20000))
#define GPIOB ((reg_gpio_t *)(AHB1_SECTION + 0x20400))
#define GPIOC ((reg_gpio_t *)(AHB1_SECTION + 0x20800))
#define GPIOD ((reg_gpio_t *)(AHB1_SECTION + 0x20c00))
#define GPIOE ((reg_gpio_t *)(AHB1_SECTION + 0x21000))
#define GPIOF ((reg_gpio_t *)(AHB1_SECTION + 0x21400))
#define GPIOG ((reg_gpio_t *)(AHB1_SECTION + 0x21800))
#define GPIOH ((reg_gpio_t *)(AHB1_SECTION + 0x21c00))
#define GPIOI ((reg_gpio_t *)(AHB1_SECTION + 0x22000))
#define GPIOJ ((reg_gpio_t *)(AHB1_SECTION + 0x22400))
#define GPIOK ((reg_gpio_t *)(AHB1_SECTION + 0x22800))

