zegonix/mc1_rohneced_schoejo2/lab13/code/unittest/reg_stm32f4xx.h
/* Helper macros */
#define GPIOA_RCC_PATTERN       ( 0x1 << 0u )
#define GPIOA_ENABLE()          REG_SET(RCC->AHBENR[0],   GPIOA_RCC_PATTERN)
#define GPIOA_DISABLE()         REG_CLR(RCC->AHBENR[0],   GPIOA_RCC_PATTERN)

#define GPIOB_RCC_PATTERN       ( 0x1 << 1u )
#define GPIOB_ENABLE()          REG_SET(RCC->AHBENR[0],   GPIOB_RCC_PATTERN)
#define GPIOB_DISABLE()         REG_CLR(RCC->AHBENR[0],   GPIOB_RCC_PATTERN)

/*  SYSCFG - system configuration controller
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_syscfg_t
 *  \brief  Representation of SYSCFG register.
 *
 *  Described in reference manual p.286ff.
 */
typedef struct {
    volatile uint32_t MEMRMP;       /**< Memory remap register. */
    volatile uint32_t PMC;          /**< Peripheral mode register. */
    volatile uint32_t EXTICR[4];    /**< External interrupt conf. register. */
    uint32_t RESERVED[2];
    volatile uint32_t CMPCR;        /**< Compensation cell control register. */
} reg_syscfg_t;


#define SYSCFG ((reg_syscfg_t *)(APB2_SECTION + 0x13800))


/*  DMA - direct memory access
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_dma_stream_t
 *  \brief  Representation of DMA stream register.
 */
typedef struct {
    volatile uint32_t CR;       /**< Stream configuration register. */
    volatile uint32_t NDTR;     /**< Number of data register. */
    volatile uint32_t PAR;      /**< Peripheral address register. */
    volatile uint32_t M0AR;     /**< Memory 0 address register. */
    volatile uint32_t M1AR;     /**< Memory 1 address register. */
    volatile uint32_t FCR;      /**< FIFO control register. */
} reg_dma_stream_t;


/**
 *  \struct reg_dma_t
 *  \brief  Representation of DMA register.
 *
 *  Described in reference manual p.299ff.
 */
typedef struct {
    volatile uint32_t ISR[2];       /**< Interrupt status register. */
    volatile uint32_t IFCR[2];      /**< Interrupt flag clear register. */
    reg_dma_stream_t STREAM[8];     /**< Struct of stream registers. */
} reg_dma_t;


#define DMA1 ((reg_dma_t *)(AHB1_SECTION + 0x26000))
#define DMA2 ((reg_dma_t *)(AHB1_SECTION + 0x26400))


/*  DMA2D - direct memory access
 * ------------------------------------------------------------------------- */


/*  NVIC - nested vector interrupt controller
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_nvic_t
 *  \brief  Representation of NVIC register.
 *
 *  Described in programming manual p.193ff.
 */
typedef struct {
    volatile uint32_t ISER[3];  /**< Interrupt set-enable register. */
    uint32_t RESERVED1[29];
    volatile uint32_t ICER[3];  /**< Interrupt clear-enable register. */
    uint32_t RESERVED2[29];
    volatile uint32_t ISPR[3];  /**< Interrupt set-pending register. */
    uint32_t RESERVED3[29];
    volatile uint32_t ICPR[3];  /**< Interrupt clear-pending register. */
    uint32_t RESERVED4[29];
    volatile uint32_t IABR[3];  /**< Interrupt active bit register. */
    uint32_t RESERVED5[61];
    volatile uint8_t IP[81];    /**< Interrupt priority. */
    uint8_t RESERVED6[3];
    uint32_t RESERVED7[684];
    volatile uint32_t STIR;     /**< Software trigger interrupt register. */
} reg_nvic_t;


#define NVIC ((reg_nvic_t *)(INTERNAL_SECTION + 0xe100))


/*  EXTI - external interrupt
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_exti_t
 *  \brief  Representation of EXTI register.
 *
 *  Described in reference manual p.368ff.
 */
typedef struct {
    volatile uint32_t IMR;      /**< Interrupt mask register. */
    volatile uint32_t EMR;      /**< Event mask register. */
    volatile uint32_t RTSR;     /**< Rising trigger selection register. */
    volatile uint32_t FTSR;     /**< Falling trigger selection register. */
    volatile uint32_t SWIER;    /**< Software interrupt event register. */
    volatile uint32_t PR;       /**< Pending register. */
} reg_exti_t;


#define EXTI ((reg_exti_t *)APB2_SECTION + 0x13c00)


/*  ADC - analog digital converter
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_adc_t
 *  \brief  Representation of ADC register.
 *
 *  Described in reference manual p.385ff.
 */
typedef struct {
    volatile uint32_t SR;       /**< Status register. */
    volatile uint32_t CR1;      /**< Control register 1. */
    volatile uint32_t CR2;      /**< Control register 2. */
    volatile uint32_t SMPR[2];  /**< Sample time register. */
    volatile uint32_t JOFR[4];  /**< Injected channel data offset register. */
    volatile uint32_t TR[2];    /**< [0]: Higher treshold register,
                                     [1]: Lower treshold register. */
    volatile uint32_t SQR[3];   /**< Regular sequence register. */
    volatile uint32_t JSQR;     /**< Injected sequence register. */
    volatile uint32_t JDR[4];   /**< Injected data register. */
    volatile uint32_t DR;       /**< Regular data register. */
} reg_adc_t;


#define ADC1 ((reg_adc_t *)APB2_SECTION + 0x12000)
#define ADC2 ((reg_adc_t *)APB2_SECTION + 0x12100)
#define ADC3 ((reg_adc_t *)APB2_SECTION + 0x12200)


/**
 *  \struct reg_adccom_t
 *  \brief  Representation of ADC common register.
 *
 *  Described in reference manual p.385ff.
 */
typedef struct {
    volatile uint32_t CSR;      /**< Common status register. */
    volatile uint32_t CCR;      /**< Common control register. */
    volatile uint32_t CDR;      /**< Common regular data register. */
} reg_adccom_t;


#define ADCCOM ((reg_adccom_t *)APB2_SECTION + 0x12300)


/*  DAC - digital analog converter
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_dac_t
 *  \brief  Representation of DAC register.
 *
 *  Described in reference manual p.430ff.
 */
typedef struct {
    volatile uint32_t CR;       /**< Control register. */
    volatile uint32_t SWTRIGR;  /**< Software trigger register. */
    volatile uint32_t DHR12R1;  /**< Ch1 12-bit right-aligned data register. */
    volatile uint32_t DHR12L1;  /**< Ch1 12-bit left-aligned data register. */
    volatile uint32_t DHR8R1;   /**< Ch1 8-bit right-aligned data register. */
    volatile uint32_t DHR12R2;  /**< Ch2 12-bit right-aligned data register. */
    volatile uint32_t DHR12L2;  /**< Ch2 12-bit left-aligned data register. */
    volatile uint32_t DHR8R2;   /**< Ch2 8-bit right-aligned data register. */
    volatile uint32_t DHR12RD;  /**< Dual 12-bit right-align. data register. */
    volatile uint32_t DHR12LD;  /**< Dual 12-bit left-aligned data register. */
    volatile uint32_t DHR8RD;   /**< Dual 8-bit right-aligned data register. */
    volatile uint32_t DOR1;     /**< Ch1 data output register. */
    volatile uint32_t DOR2;     /**< Ch2 data output register. */
    volatile uint32_t SR;       /**< Status register. */
} reg_dac_t;


