zegonix/mc1_rohneced_schoejo2/lab13/code/unittest/reg_stm32f4xx.h
#define DAC ((reg_dac_t *)(APB1_SECTION + 0x7400))


/*  DCMI - digital camery mxxx interface
 * ------------------------------------------------------------------------- */


/*  LTDC - liquid txxx display controller
 * ------------------------------------------------------------------------- */


/*  TIM - timer
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_tim_t
 *  \brief  Representation of TIM register.
 *
 *  Described in reference manual p.576ff.
 */
typedef struct {
    volatile uint32_t CR1;      /**< . */
    volatile uint32_t CR2;      /**< . */
    volatile uint32_t SMCR;     /**< . */
    volatile uint32_t DIER;     /**< . */
    volatile uint32_t SR;       /**< . */
    volatile uint32_t EGR;      /**< . */
    volatile uint32_t CCMR[2];  /**< . */
    volatile uint32_t CCER;     /**< . */
    volatile uint32_t CNT;      /**< . */
    volatile uint32_t PSC;      /**< . */
    volatile uint32_t ARR;      /**< . */
    volatile uint32_t RCR;      /**< . */
    volatile uint32_t CCR[4];   /**< . */
    volatile uint32_t BDTR;     /**< . */
    volatile uint32_t DCR;      /**< . */
    volatile uint32_t DMAR;     /**< . */
    volatile uint32_t OR;       /**< . */
} reg_tim_t;


#define TIM1  ((reg_tim_t *)(APB2_SECTION + 0x10000))
#define TIM2  ((reg_tim_t *)(APB1_SECTION + 0x0000))
#define TIM3  ((reg_tim_t *)(APB1_SECTION + 0x0400))
#define TIM4  ((reg_tim_t *)(APB1_SECTION + 0x0800))
#define TIM5  ((reg_tim_t *)(APB1_SECTION + 0x0c00))
#define TIM6  ((reg_tim_t *)(APB1_SECTION + 0x1000))
#define TIM7  ((reg_tim_t *)(APB1_SECTION + 0x1400))
#define TIM8  ((reg_tim_t *)(APB2_SECTION + 0x10400))
#define TIM9  ((reg_tim_t *)(APB2_SECTION + 0x14000))
#define TIM10 ((reg_tim_t *)(APB2_SECTION + 0x14400))
#define TIM11 ((reg_tim_t *)(APB2_SECTION + 0x14800))
#define TIM12 ((reg_tim_t *)(APB1_SECTION + 0x1800))
#define TIM13 ((reg_tim_t *)(APB1_SECTION + 0x1c00))
#define TIM14 ((reg_tim_t *)(APB1_SECTION + 0x2000))


/* Helper macros */

#define TIM4_RCC_PATTERN        ( 0x1 << 2u )
#define TIM4_ENABLE()           REG_SET(RCC->APBENR[0],   TIM4_RCC_PATTERN)
#define TIM4_DISABLE()          REG_CLR(RCC->APBENR[0],   TIM4_RCC_PATTERN)


/*  IWDG - independent watchdog
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_iwdg_t
 *  \brief  Representation of IWDG register.
 *
 *  Described in reference manual p.689ff.
 */
typedef struct {
    volatile uint32_t KR;       /**< . */
    volatile uint32_t PR;       /**< . */
    volatile uint32_t RLR;      /**< . */
    volatile uint32_t SR;       /**< . */
} reg_iwdg_t;


#define IWDG ((reg_iwdg_t *)(APB1_SECTION + 0x3000))


/*  WWDG - window watch dog
 * ------------------------------------------------------------------------- */


/*  CRYP - cryptxxxx
 * ------------------------------------------------------------------------- */


/*  RNG - random number generator
 * ------------------------------------------------------------------------- */


/*  HASH - hashxxx
 * ------------------------------------------------------------------------- */


/*  RTC - real time clock
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_rtc_t
 *  \brief  Representation of RTC register.
 *
 *  Described in reference manual p.778ff.
 */
typedef struct {
    volatile uint32_t TR;       /**< . */
    volatile uint32_t DR;       /**< . */
    volatile uint32_t CR;       /**< . */
    volatile uint32_t ISR;      /**< . */
    volatile uint32_t PRER;     /**< . */
    volatile uint32_t WUTR;     /**< . */
    volatile uint32_t CALIBR;   /**< . */
    volatile uint32_t ALRMAR;   /**< . */
    volatile uint32_t ALRMBR;   /**< . */
    volatile uint32_t WPR;      /**< . */
    volatile uint32_t SSR;      /**< . */
    volatile uint32_t SHIFTR;   /**< . */
    volatile uint32_t TSTR;     /**< . */
    volatile uint32_t TSDR;     /**< . */
    volatile uint32_t TSSSR;    /**< . */
    volatile uint32_t CALR;     /**< . */
    volatile uint32_t TAFCR;    /**< . */
    volatile uint32_t ALRMASSR; /**< . */
    volatile uint32_t ALRMBSSR; /**< . */
    uint32_t RESERVED;
    volatile uint32_t BKPR[20]; /**< . */
} reg_rtc_t;


#define RTC ((reg_rtc_t *)(APB1_SECTION + 0x2800))


/*  I2C - inter-integrated circuit interface
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_i2c_t
 *  \brief  Representation of I2C register.
 *
 *  Described in reference manual p.817ff.
 */
typedef struct {
    volatile uint32_t CR1;      /**< . */
    volatile uint32_t CR2;      /**< . */
    volatile uint32_t OAR1;     /**< . */
    volatile uint32_t OAR2;     /**< . */
    volatile uint32_t DR;       /**< . */
    volatile uint32_t SR1;      /**< . */
    volatile uint32_t SR2;      /**< . */
    volatile uint32_t CCR;      /**< . */
    volatile uint32_t TRISE;    /**< . */
    volatile uint32_t FLTR;     /**< . */
} reg_i2c_t;


#define I2C1 ((reg_i2c_t *)(APB1_SECTION + 0x5400))
#define I2C2 ((reg_i2c_t *)(APB1_SECTION + 0x5800))
#define I2C3 ((reg_i2c_t *)(APB1_SECTION + 0x5c00))


/*  SPI - serial peripheral interface
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_spi_t
 *  \brief  Representation of SPI register.
 *
 *  Described in reference manual p.852ff.
 */
typedef struct {
    volatile uint32_t CR1;      /**< . */
    volatile uint32_t CR2;      /**< . */
    volatile uint32_t SR;       /**< . */
    volatile uint32_t DR;       /**< . */
    volatile uint32_t CRCPR;    /**< . */
    volatile uint32_t RXCRCR;   /**< . */
    volatile uint32_t TXCRCR;   /**< . */
    volatile uint32_t I2SCFGR;  /**< . */
    volatile uint32_t I2SPR;    /**< . */
} reg_spi_t;


#define SPI1 ((reg_spi_t *)(APB2_SECTION + 0x13000))
#define SPI2 ((reg_spi_t *)(APB1_SECTION + 0x3800))
#define SPI3 ((reg_spi_t *)(APB1_SECTION + 0x3c00))
#define SPI4 ((reg_spi_t *)(APB2_SECTION + 0x13400)
#define SPI5 ((reg_spi_t *)(APB2_SECTION + 0x15000)
#define SPI6 ((reg_spi_t *)(APB2_SECTION + 0x15400)


/*  SAI - sxxx audio interface
 * ------------------------------------------------------------------------- */


/*  USART - universal synchronous/asynchronous receiver transmitter
 * ------------------------------------------------------------------------- */


/*  SDIO - secure digital input output
 * ------------------------------------------------------------------------- */


