zegonix/mc1_rohneced_schoejo2/lab13/code/unittest/reg_stm32f4xx.h
/*  CAN - cxxx
 * ------------------------------------------------------------------------- */


/*  ETH/MAC - network
 * ------------------------------------------------------------------------- */


/*  FMC - flexible memory controller
 * ------------------------------------------------------------------------- */
//#define FMC_BASE                        (0xa0000000)

/**
 *  \struct reg_fmc_sram_t
 *  \brief  Representation of SRAM register (Bank 1).
 */
typedef struct {
    volatile uint32_t BCR1;     /**< (Sub)Bank 1 control register. */
    volatile uint32_t BTR1;     /**< (Sub)Bank 1 timing registers. */
    volatile uint32_t BCR2;     /**< (Sub)Bank 2 control register. */
    volatile uint32_t BTR2;     /**< (Sub)Bank 2 timing registers. */
    volatile uint32_t BCR3;     /**< (Sub)Bank 3 control register. */
    volatile uint32_t BTR3;     /**< (Sub)Bank 3 timing registers. */
    volatile uint32_t BCR4;     /**< (Sub)Bank 4 control register. */
    volatile uint32_t BTR4;     /**< (Sub)Bank 4 timing registers. */
    uint32_t RESERVED1[57];
    volatile uint32_t BWTR1;    /**< (Sub)Bank 1 write timing registers. */
    uint32_t RESERVED2;
    volatile uint32_t BWTR2;    /**< (Sub)Bank 2 write timing registers. */
    uint32_t RESERVED3;
    volatile uint32_t BWTR3;    /**< (Sub)Bank 3 write timing registers. */
    uint32_t RESERVED4;
    volatile uint32_t BWTR4;    /**< (Sub)Bank 4 write timing registers. */
} reg_fmc_sram_t;


/**
 *  \struct reg_fmc_t
 *  \brief  Representation of FMC register.
 *
 *  Described in reference manual p.1580ff.
 */
typedef struct {
    reg_fmc_sram_t SRAM;        /**< SRAM registers (Bank 1). */
} reg_fmc_t;


/* Register macro */

#define FMC                     ( (reg_fmc_t *) FMC_BASE )


/* Helper macros */

#define FMC_ENABLE()            REG_SET(RCC->AHBENR[2],   FMC_RCC_PATTERN)
#define FMC_DISABLE()           REG_CLR(RCC->AHBENR[2],   FMC_RCC_PATTERN)



///* Bank 1 */
#define REG_FMC_BCR1 (*((volatile uint32_t *)(FMC_BASE + 0x00)))
#define REG_FMC_BTR1 (*((volatile uint32_t *)(FMC_BASE + 0x04)))
#define REG_FMC_BCR2 (*((volatile uint32_t *)(FMC_BASE + 0x08)))
#define REG_FMC_BTR2 (*((volatile uint32_t *)(FMC_BASE + 0x0c)))

#define REG_FMC_BCR3 (*((volatile uint32_t *)FMC_BASE + 0x10))
#define REG_FMC_BTR3 (*((volatile uint32_t *)FMC_BASE + 0x14))
#define REG_FMC_BCR4 (*((volatile uint32_t *)FMC_BASE + 0x18))
#define REG_FMC_BTR4 (*((volatile uint32_t *)FMC_BASE + 0x1c))


/* Bank 2 */
#define REG_FMC_PCR2  (*((volatile uint32_t *)(FMC_BASE + 0x60)))
#define REG_FMC_SR2   (*((volatile uint32_t *)(FMC_BASE + 0x64)))
#define REG_FMC_PMEM2 (*((volatile uint32_t *)(FMC_BASE + 0x68)))
#define REG_FMC_PATT2 (*((volatile uint32_t *)(FMC_BASE + 0x6c)))

#define REG_FMC_ECCR2 (*((volatile uint32_t *)(FMC_BASE + 0x74)))


/* Bank 3 */
#define REG_FMC_PCR3  (*((volatile uint32_t *)FMC_BASE + 0x80))
#define REG_FMC_SR3   (*((volatile uint32_t *)FMC_BASE + 0x84))
#define REG_FMC_PMEM3 (*((volatile uint32_t *)FMC_BASE + 0x88))
#define REG_FMC_PATT3 (*((volatile uint32_t *)FMC_BASE + 0x8c))

#define REG_FMC_ECCR3 (*((volatile uint32_t *)FMC_BASE + 0x94))

/* Bank 4 */
#define REG_FMC_PCR4  (*((volatile uint32_t *)FMC_BASE + 0xa0))
#define REG_FMC_SR4   (*((volatile uint32_t *)FMC_BASE + 0xa4))
#define REG_FMC_PMEM4 (*((volatile uint32_t *)FMC_BASE + 0xa8))
#define REG_FMC_PATT4 (*((volatile uint32_t *)FMC_BASE + 0xac))

#define REG_FMC_PIO4  (*((volatile uint32_t *)FMC_BASE + 0xb0))

/* Bank 1E */
#define REG_FMC_BWTR1 (*((volatile uint32_t *)(FMC_BASE + 0x104)))
#define REG_FMC_BWTR2 (*((volatile uint32_t *)(FMC_BASE + 0x10c)))

#define REG_FMC_BWTR3 (*((volatile uint32_t *)FMC_BASE + 0x114))
#define REG_FMC_BWTR4 (*((volatile uint32_t *)FMC_BASE + 0x11c))

/* SD RAM - Bank 5/6 */
#define REG_FMC_SDCR1 (*((volatile uint32_t *)FMC_BASE + 0x140))
#define REG_FMC_SDCR2 (*((volatile uint32_t *)FMC_BASE + 0x144))
#define REG_FMC_SDTR1 (*((volatile uint32_t *)FMC_BASE + 0x148))
#define REG_FMC_SDTR2 (*((volatile uint32_t *)FMC_BASE + 0x14c))
#define REG_FMC_SDCMR (*((volatile uint32_t *)FMC_BASE + 0x150))
#define REG_FMC_SDRTR (*((volatile uint32_t *)FMC_BASE + 0x154))
#define REG_FMC_SDSR  (*((volatile uint32_t *)FMC_BASE + 0x158))

/** \TODO ALLES. */


/*  MPU - memory protection unit
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_mpu_t
 *  \brief  Representation of MPU register.
 *
 *  Described in programming manual p.178ff.
 */
typedef struct {
    volatile uint32_t TYPER;    /**< . */
    volatile uint32_t CTRL;     /**< . */
    volatile uint32_t RNR;      /**< . */
    volatile uint32_t RBAR;     /**< . */
    volatile uint32_t RASR;     /**< . */
    /* Alias of previous two registers
       volatile uint32_t RBAR_A1;
       volatile uint32_t RASR_A1;
       volatile uint32_t RBAR_A2;
       volatile uint32_t RASR_A2; */
} reg_mpu_t;


#define MPU ((reg_mpu_t *)(INTERNAL_SECTION + 0xed90))


/*  SCB - system control block
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_scb_t
 *  \brief  Representation of SCB register.
 *
 *  Described in programming manual p.206ff.
 */
typedef struct {
    volatile uint32_t CPUID;    /**< . */
    volatile uint32_t ICSR;     /**< . */
    volatile uint32_t VTOR;     /**< . */
    volatile uint32_t AIRCR;    /**< . */
    volatile uint32_t SCR;      /**< . */
    volatile uint32_t CCR;      /**< . */
    volatile uint32_t SHPR[4];  /**< . */
    volatile uint32_t CFSR;     /**< . */
    volatile uint32_t HFSR;     /**< . */
    volatile uint32_t NMAR;     /**< . */
    volatile uint32_t BFAR;     /**< . */
    volatile uint32_t AFSR;     /**< . */
//    volatile uint32_t PFR[2];   /**< . */
//    volatile uint32_t DFR;      /**< . */
//    volatile uint32_t ADR;      /**< . */
//    volatile uint32_t MMFR[4];  /**< . */
//    volatile uint32_t ISAR;     /**< Instruction Set Attributes Register. */
//    uint32_t RESERVED[5];
//    volatile uint32_t CPACR;    /**< Coprocessor Access Control Register. */
} reg_scb_t;


#define SCB ((reg_scb_t *)(INTERNAL_SECTION + 0xed00))


/*  STK - system tick timer
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_stk_t
 *  \brief  Representation of STK register.
 *
 *  Described in programming manual p.230ff.
 */
typedef struct {
    volatile uint32_t CTRL;     /**< . */
    volatile uint32_t LOAD;     /**< . */
    volatile uint32_t VAL;      /**< . */
    volatile uint32_t CALIB;    /**< . */
} reg_stk_t;


#define STK ((reg_stk_t *)(INTERNAL_SECTION + 0xe010))


/*  FPU - floating point unit
 * ------------------------------------------------------------------------- */

/**
 *  \struct reg_fpu_t
 *  \brief  Representation of FPU register.
 *
 *  Described in programming manual p.236ff.
 */
typedef struct {
    volatile uint32_t CPACR;    /**< . */
    uint32_t RESERVED[106];     /**< . */
    volatile uint32_t FPCCR;    /**< . */
    volatile uint32_t FPCAR;    /**< . */
    volatile uint32_t FPDSCR;   /**< . */
} reg_fpu_t;


#define FPU ((reg_fpu_t *)(INTERNAL_SECTION + 0xed88))
#endif
